{
    "pluginmetadataversion": 2,
    "name": "peutils",
    "type": ["helper"],
    "api": ["python3"],
    "description": "Binary Ninja plugin providing various niche utilities for working with PE binaries",
    "longdescription": "# Binary Ninja PE Utils\nBunch'a niche utilities for working with PE-based binaries.\n\n## Features\n\n### Resolve ordinal imports\nOrdinal imports can be resolved to symbol names from external BNDBs.\nIf you rename an exported function in the external BNDB, the name you\ndefined will be used instead of the original export name.\n\nGiven an example import as shown below:\n\n![Import table with unresolved ordinals](https://raw.githubusercontent.com/404d/peutils/master/screens/table_not_loaded.png)\n\n![IAT with unresolved ordinals](https://raw.githubusercontent.com/404d/peutils/master/screens/iat_unsynced.png)\n\nBy loading a binary view for `OLEAUT32.dll`, we can update the import\nnames for the target binary view with the real name behind the import:\n\n![Import table with resolved ordinals](https://raw.githubusercontent.com/404d/peutils/master/screens/table_loaded.png)\n\n![IAT with resolved ordinals](https://raw.githubusercontent.com/404d/peutils/master/screens/iat_synced.png)\n\n\n### Synchronize symbol names and types across binaries\nTypes defined in external BNDBs can be transferred to the current binary\nview in order to aid with reversing.\n\nContinuing from the above example, we can rename the arg of the function\n`SysStringLen` from the external BNDB `OLEAUT32.dll`:\n\n![Function with renamed argument](https://raw.githubusercontent.com/404d/peutils/master/screens/func_renamed_arg.png)\n\nWhen synced, the IAT will be updated with the new argument:\n\n![IAT with renamed argument](screens/iat_renamed.png)\n\nWe can also see that the new argument is exposed through other\ndisassembly views, like MLIL:\n\n![MLIL call with renamed argument](https://raw.githubusercontent.com/404d/peutils/master/screens/mlil_renamed_arg.png)\n\nAs mentioned earlier, symbol names also get transferred between loaded BNDBs.\nRenaming the export from the external BNDB then resyncing, we can see that the\nchanges is transferred to the target binary view:\n\n![Function with renamed symbol](https://raw.githubusercontent.com/404d/peutils/master/screens/func_renamed_sym.png)\n\n![MLIL call with renamed symbol](https://raw.githubusercontent.com/404d/peutils/master/screens/mlil_renamed_sym.png)\n",

    "license": {
        "name": "MIT",
        "text": "Copyright (c) 2017-2019 Simen Lybekk\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE."
    },
    "platforms": ["Windows", "Linux", "Darwin"],
    "installinstructions": {
        "Windows": "Download or clone the github repo and place it in your plugins folder: https://github.com/404d/peutils",
        "Linux": "Download or clone the github repo and place it in your plugins folder: https://github.com/404d/peutils",
        "Darwin": "Download or clone the github repo and place it in your plugins folder: https://github.com/404d/peutils"
    },
    "dependencies": {
    },
    "minimumbinaryninjaversion": 2576,
    "version": "1.2",
    "author": "404'd"
}

